>>> server -> client: 65, 66
>>> Cycle()
>> 01 03 00 14 00 01 C4 0E
Modbus ErrorCallback: <modbus:1:holding: 20>: no error
Modbus Callback: <modbus:1:holding: 20> becomes A
<< 01 03 02 00 41 78 74
>> 01 04 00 1E 00 01 51 CC
Modbus ErrorCallback: <modbus:1:input: 30>: no error
Modbus Callback: <modbus:1:input: 30> becomes B
<< 01 04 02 00 42 39 01
>>> client -> server: '!'
>>> Cycle()
>> 01 06 00 14 00 21 09 D6
<< 01 06 00 14 00 21 09 D6
>> 01 03 00 14 00 01 C4 0E
Modbus Callback: <modbus:1:holding: 20> becomes ! [unchanged]
<< 01 03 02 00 21 78 5C
>> 01 04 00 1E 00 01 51 CC
Modbus Callback: <modbus:1:input: 30> becomes B [unchanged]
<< 01 04 02 00 42 39 01
(pty-based fake serial -- stopping forwarding)
