>>> server -> client: 40ba401f7ced9168 , 4093b148b4395810
>>> Cycle()
>> 01 03 00 14 00 08 04 08
Modbus ErrorCallback: <modbus:1:holding: 20>: no error
Modbus Callback: <modbus:1:holding: 20> becomes 6720.123
Modbus ErrorCallback: <modbus:1:holding: 24>: no error
Modbus Callback: <modbus:1:holding: 24> becomes 0
<< 01 03 10 40 BA 40 1F 7C ED 91 68 00 00 00 00 00 00 00 00 21 BF
>> 01 04 00 1E 00 04 91 CF
Modbus ErrorCallback: <modbus:1:input: 30>: no error
Modbus Callback: <modbus:1:input: 30> becomes 1260.321
<< 01 04 08 40 93 B1 48 B4 39 58 10 B5 2A
>>> client -> server: 10
>>> Cycle()
>> 01 10 00 14 00 04 08 40 25 FF F2 E4 8E 8A 72 6A FC
<< 01 10 00 14 00 04 81 CE
>> 01 03 00 14 00 08 04 08
Modbus Callback: <modbus:1:holding: 20> becomes 10.9999 [unchanged]
Modbus Callback: <modbus:1:holding: 24> becomes 0 [unchanged]
<< 01 03 10 40 25 FF F2 E4 8E 8A 72 00 00 00 00 00 00 00 00 3D 8F
>> 01 04 00 1E 00 04 91 CF
Modbus Callback: <modbus:1:input: 30> becomes 1260.321 [unchanged]
<< 01 04 08 40 93 B1 48 B4 39 58 10 B5 2A
>>> client -> server: -0.00123
>>> Cycle()
>> 01 10 00 14 00 04 08 BF 54 26 FE 71 8A 86 D7 EE 81
<< 01 10 00 14 00 04 81 CE
>> 01 03 00 14 00 08 04 08
Modbus Callback: <modbus:1:holding: 20> becomes -0.00123 [unchanged]
Modbus Callback: <modbus:1:holding: 24> becomes 0 [unchanged]
<< 01 03 10 BF 54 26 FE 71 8A 86 D7 00 00 00 00 00 00 00 00 99 1B
>> 01 04 00 1E 00 04 91 CF
Modbus Callback: <modbus:1:input: 30> becomes 1260.321 [unchanged]
<< 01 04 08 40 93 B1 48 B4 39 58 10 B5 2A
>>> client -> server: -0.123 (scaled)
>>> Cycle()
>> 01 10 00 18 00 04 08 BF 54 26 FE 71 8A 86 D7 FE 91
<< 01 10 00 18 00 04 41 CD
>> 01 03 00 14 00 08 04 08
Modbus Callback: <modbus:1:holding: 20> becomes -0.00123 [unchanged]
Modbus Callback: <modbus:1:holding: 24> becomes -0.123 [unchanged]
<< 01 03 10 BF 54 26 FE 71 8A 86 D7 BF 54 26 FE 71 8A 86 D7 F1 D0
>> 01 04 00 1E 00 04 91 CF
Modbus Callback: <modbus:1:input: 30> becomes 1260.321 [unchanged]
<< 01 04 08 40 93 B1 48 B4 39 58 10 B5 2A
>>> server -> client: 4093b00000000000 (scaled)
>>> Cycle()
>> 01 03 00 14 00 08 04 08
Modbus Callback: <modbus:1:holding: 20> becomes -0.00123 [unchanged]
Modbus Callback: <modbus:1:holding: 24> becomes 126000
<< 01 03 10 BF 54 26 FE 71 8A 86 D7 40 93 B0 00 00 00 00 00 24 12
>> 01 04 00 1E 00 04 91 CF
Modbus Callback: <modbus:1:input: 30> becomes 1260.321 [unchanged]
<< 01 04 08 40 93 B1 48 B4 39 58 10 B5 2A
(pty-based fake serial -- stopping forwarding)
