>>> server -> client: 10, 20
>>> Cycle()
>> 01 03 00 14 00 02 84 0F
Modbus ErrorCallback: <modbus:1:holding: 20>: no error
Modbus Callback: <modbus:1:holding: 20> becomes 11141307
<< 01 03 04 00 AA 00 BB 9A 60
>> 01 04 00 1E 00 02 11 CD
Modbus ErrorCallback: <modbus:1:input: 30>: no error
Modbus Callback: <modbus:1:input: 30> becomes 4294967295
<< 01 04 04 FF FF FF FF FA 10
>>> client -> server: 10
>>> Cycle()
>> 01 10 00 14 00 02 04 00 00 00 0A 73 57
<< 01 10 00 14 00 02 01 CC
>> 01 03 00 14 00 02 84 0F
Modbus Callback: <modbus:1:holding: 20> becomes 10 [unchanged]
<< 01 03 04 00 00 00 0A 7A 34
>> 01 04 00 1E 00 02 11 CD
Modbus Callback: <modbus:1:input: 30> becomes 4294967295 [unchanged]
<< 01 04 04 FF FF FF FF FA 10
>>> client -> server: -1 (overflow)
>>> Cycle()
>> 01 10 00 14 00 02 04 FF FF FF FF F2 C4
<< 01 10 00 14 00 02 01 CC
>> 01 03 00 14 00 02 84 0F
Modbus Callback: <modbus:1:holding: 20> becomes 4294967295 [unchanged]
<< 01 03 04 FF FF FF FF FB A7
>> 01 04 00 1E 00 02 11 CD
Modbus Callback: <modbus:1:input: 30> becomes 4294967295 [unchanged]
<< 01 04 04 FF FF FF FF FA 10
>>> client -> server: 4294967296 (overflow)
>>> Cycle()
>> 01 10 00 14 00 02 04 00 00 00 00 F3 50
<< 01 10 00 14 00 02 01 CC
>> 01 03 00 14 00 02 84 0F
Modbus Callback: <modbus:1:holding: 20> becomes 0 [unchanged]
<< 01 03 04 00 00 00 00 FA 33
>> 01 04 00 1E 00 02 11 CD
Modbus Callback: <modbus:1:input: 30> becomes 4294967295 [unchanged]
<< 01 04 04 FF FF FF FF FA 10
(pty-based fake serial -- stopping forwarding)
